driver-tests/httpsoapbc/HttpSoapBCTests/HttpSoapBCJbi/test/MultiOpDiffMsgElemCTypeSameAct_Operation2_Invoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
        xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" 
        xmlns:xsd="http://www.w3.org/1999/XMLSchema"
        xmlns:tns="http://seebeyond.com/Echo/" 
        xmlns="http://new.webservice.namespace"> 
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body> 
        <body>
            <Field2_1>This should get replaced.</Field2_1>
            <Field2_2>987</Field2_2>
        </body>
    </SOAP-ENV:Body> 
</SOAP-ENV:Envelope>